insert into materials(material_id, material_name, cal)
values (1, '豚肉', 100),
       (2, '鶏肉', 200),
       (3, '牛肉', 300),
       (4, '八方出汁', 10),
       (5, '塩', 5),
       (6, '胡椒', 5),
       (7, '生姜', 5),
       (8, 'キャベツ', 2),
       (9, 'レタス', 2),
       (10, '人参', 4),
       (11, '水', 0),
       (12, '白米', 80),
       (13, '玄米', 60),
       (14, '卵', 150);

insert into recipes(recipe_id, recipe_name)
values (1, '豚肉の生姜焼き'),
       (2, 'チキンソテー'),
       (3, '牛ハンバーグ'),
       (4, 'レタスサラダ'),
       (5, '人参サラダ'),
       (6, 'ご飯');

insert into recipe_material(recipe_id, material_id, amount)
values (1, 1, 90),
       (1, 7, 10),
       (1, 5, 3),
       (2, 2, 100),
       (2, 4, 10),
       (2, 5, 4),
       (3, 3, 80),
       (3, 14, 30),
       (3, 5, 5),
       (4, 9, 100),
       (5, 8, 50),
       (5, 10, 50),
       (6, 12, 50),
       (5, 11, 50);

insert into menus(menu_id, menu_name)
values (1, '牛ハンバーグ弁当'),
       (2, 'チキン弁当'),
       (3, '生姜焼き弁当');

insert into menu_recipe(menu_id, recipe_id, amount)
values (1, 3, 80),
       (1, 6, 50),
       (1, 5, 20),
       (2, 2, 120),
       (2, 6, 50),
       (2, 4, 20),
       (3, 1, 100),
       (3, 6, 50),
       (3, 5, 30);

